export const DATA_LIST = [
  [
    "序号",
    "角色ID",
    "角色名称",
    "角色描述",
    "部门名称",
    "角色创建人",
    "权限类型",
    "角色权限",
    "角色权限",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "我的任务",
    "我的审批单",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "我的任务",
    "交易事件提醒",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "持仓明细",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "标的风险盈亏",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "到期合约风险",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "投资组合风险",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "标的物情景分析",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "实时风险&盈亏",
  ],
];

// c 代表列号，r 代表行号
export const MERGES_LIST = [
  {
    //合并第一行数据的【7、8】列
    s: {
      // s开始
      c: 7, // H1
      r: 0,
    },
    e: {
      // e结束
      c: 8, // I1
      r: 0,
    },
  },
  // 合并第【A-G】列的【1-8】行
  ...[...Array(7).keys()].map((v) => {
    return {
      s: {
        c: v,
        r: 1,
      },
      e: {
        c: v,
        r: 8,
      },
    };
  }),
  {
    // 合并H列的【1-2】行
    s: {
      c: 7,
      r: 1,
    },
    e: {
      c: 7,
      r: 2,
    },
  },
  {
    // 合并H列的【3-8】行
    s: {
      c: 7,
      r: 3,
    },
    e: {
      c: 7,
      r: 8,
    },
  },
];
