export const DATA = [
  [
    "序号",
    "角色ID",
    "角色名称",
    "角色描述",
    "部门名称",
    "角色创建人",
    "权限类型",
    "角色权限",
    "角色权限",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "我的任务",
    "我的审批单",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "我的任务",
    "交易事件提醒",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "持仓明细",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "标的风险盈亏",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "到期合约风险",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "投资组合风险",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "标的物情景分析",
  ],
  [
    "1",
    "1",
    "金总部交易员",
    "金总部交易员",
    "无部门",
    "系统管理员",
    "页面权限",
    "实时风控",
    "实时风险&盈亏",
  ],
];

export const MERGES_LIST = [
  {
    //合并第一行数据的【7、8】列
    s: {
      //s为开始
      c: 7, //开始列
      r: 0, //开始取值范围
    },
    e: {
      //e结束
      c: 8, //结束列
      r: 0, //结束范围
    },
  },
  {
    //合并A1-A10单元格
    s: {
      //s为开始
      c: 0, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 0, //结束列
      r: 8, //结束范围
    },
  },
  {
    //合并A1-A10单元格
    s: {
      //s为开始
      c: 1, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 1, //结束列
      r: 8, //结束范围
    },
  },
  {
    //合并A1-A10单元格
    s: {
      //s为开始
      c: 2, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 2, //结束列
      r: 8, //结束范围
    },
  },
  {
    //合并A1-A10单元格
    s: {
      //s为开始
      c: 3, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 3, //结束列
      r: 8, //结束范围
    },
  },
  {
    //合并A1-A10单元格
    s: {
      //s为开始
      c: 4, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 4, //结束列
      r: 8, //结束范围
    },
  },
  {
    //合并A1-A10单元格
    s: {
      //s为开始
      c: 5, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 5, //结束列
      r: 8, //结束范围
    },
  },
  {
    //合并A1-A10单元格
    s: {
      //s为开始
      c: 6, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 6, //结束列
      r: 8, //结束范围
    },
  },
  {
    //合并第一行数据的【7、8】列
    s: {
      //s为开始
      c: 7, //开始列
      r: 1, //开始取值范围
    },
    e: {
      //e结束
      c: 7, //结束列
      r: 2, //结束范围
    },
  },
  {
    //合并第一行数据的【7、8】列
    s: {
      //s为开始
      c: 7, //开始列
      r: 3, //开始取值范围
    },
    e: {
      //e结束
      c: 7, //结束列
      r: 8, //结束范围
    },
  },
];
